--- a/README.md
+++ b/README.md
@@ -9,52 +9,71 @@
+```
 
 ### Book
-````plantuml
-@startuml
 
-!theme cyborg     
-skinparam classAttributeIconSize 0 
-
-struct Livre {
-  - titre: String
-  - auteur: String
-  - annee_publication: u16
-  - nombre_pages: u32
-  - genre: Genre
-  - statut: Statut
+```mermaid
+%%{init: {"theme": "dark"}}%%
+classDiagram
+class Livre {
+    <<Struct>>
+    -String titre
+    -String auteur
+    -u16 annee_publication
+    -u32 nombre_pages
+    -Genre genre
+    -Statut statut
 }
 
-enum Genre {
-  Roman
-  Science
-  Informatique
-  Biographie
-  Autre
+class Genre {
+    <<Enumeration>>
+    Roman
+    Science
+    Informatique
+    Biographie
+    Autre
 }
 
-enum Statut {
-  Disponible
-  Emprunte
+class Statut {
+    <<Enumeration>>
+    Disponible
+    Emprunte
 }
 
-Livre --> Genre : possède
-Livre --> Statut : possède
+Livre --> Genre : possede
+Livre --> Statut : possede
+```
 
-@enduml
-````
+### Trait Rust
+
+Un trait Rust se represente comme une interface avec une relation de
